
text = "hello, python!"
print(text[0])#выводит первый символ
print(text[0:5])#выводит под строку текст от 0 до 5 символа
print(text[4:10])#выведет строку от 4 до 10 символа 
print(text[0:14])#выведет всю строку
print(text[7:])#выведет всю строку начиная с 7 символа 
print(text[:5])#выводит всю строку до 5 символа
print(text[:])#выведет всю строку
print(text[-1])#выводит последний символ
print(text[-1:-14])#не сработает выведет пустую строку
print(text[::2])#третий аргумент-шаг выведет каждый второй символ
print(text[::-1])#шаг отрицательный выведет фразу на оборот
print ( text + "Nice to code You")#выведет новую строку 
print(text[-1]*10)#выведет 10 восклицательных знаков


